import { createSlice } from "@reduxjs/toolkit";

const dialogData = [
    { id: 1, title: 'भगत सिंह', content: 'इंक़लाब ज़िन्दाबाद! भगत सिंह, निडर स्वतंत्रता सेनानी, जिन्होंने राष्ट्र के लिए अपना जीवन बलिदान किया।' },
    { id: 2, title: 'रानी लक्ष्मीबाई', content: 'झाँसी की रानी, साहस और शूरवीरता की प्रतीक, जो 1857 के भारतीय बगावत में साहसपूर्वक युद्ध किया।' },
    { id: 3, title: 'सुभाष चंद्र बोस', content: 'नेताजी सुभाष चंद्र बोस, करिश्माई नेता, और उनका प्रसिद्ध नारा - "मुझे रक्त दो, मैं तुम्हें आज़ादी दूंगा!"' },
    { id: 4, title: 'सरदार पटेल', content: 'सरदार वल्लभभाई पटेल, भारत के लोहे का आदमी, ने राजवंशी राज्यों को भारतीय संघ में सम्मिलित करने में कुंजी भूमिका निभाई।' },
    { id: 5, title: 'बिरसा मुंडा', content: 'बिरसा मुंडा, जनजाति के नेता और स्वतंत्रता सेनानी, जो ब्रिटिश शासन के खिलाफ मुंडा विद्रोह का मार्गदर्शन किया।' },
    { id: 6, title: 'लाला लाजपत राय', content: 'पंजाब केसरी लाला लाजपत राय, भारतीय स्वतंत्रता आंदोलन के प्रमुख नेता और स्वदेशी के पक्षपाती अभिभाषक।' },
    { id: 7, title: 'राजेन्द्र प्रसाद', content: 'डॉ. राजेन्द्र प्रसाद, भारत के पहले राष्ट्रपति, और भारतीय संविधान को रूपांतरित करने में कुंजी फिगर।' },
    { id: 8, title: 'चंद्रशेखर आज़ाद', content: 'चंद्रशेखर आज़ाद, निडर क्रांतिकारी जो काकोरी साजिश में महत्वपूर्ण भूमिका निभाई और ब्रिटिश द्वारा अजीत रहे।' },
    { id: 9, title: 'अल्लुरी सीताराम राजु', content: 'अल्लुरी सीताराम राजु, जनजाति नेता और स्वतंत्रता सेनानी, जो ब्रिटिश राज के खिलाफ राम्पा विद्रोह की नेतृत्व की।' },
    { id: 10, title: 'खुदीराम बोस', content: 'खुदीराम बोस, सबसे युवा क्रांतिकारी में से एक, ने भारतीय स्वतंत्रता के लिए अपना जीवन बलिदान किया।' },
    { id: 11, title: 'सरोजिनी नायडू', content: 'सरोजिनी नायडू, भारत की बुलबुल, कवित्री, और भारतीय राष्ट्रीय आंदोलन में प्रमुख नेता।' },
    { id: 12, title: 'मंगल पांडे', content: 'मंगल पांडे, वह सेपाई जो भारतीय बगावत 1857 के घटनाओं में महत्वपूर्ण भूमिका निभाई।' },
  ];
  


  const DialogSlice = createSlice({
    name:'dialog',
    initialState:{
        data: dialogData
    },
    reducers: {
        setDialogData :(state,action) =>{
            state.data = action.payload
        }
    }
  })

  export const {setDialogData} = DialogSlice.actions
  export const selectDialogData = (state) => state.dialogData.data;
  export default DialogSlice.reducer;